Revit 2026 API

# DatumEnds Enumeration

---

An enumerated type representing ends of a datum plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DatumEnds
```
```vb
Public Enumeration DatumEnds
```
```cpp
public enum class DatumEnds
```
```fsharp
type DatumEnds
```

| Member name | Value | Description |
| --- | --- | --- |
| End0 | 0 | The start point of the datum plane in the view. |
| End1 | 1 | The end point of the datum plane in the view. |

#### Reference

Autodesk.Revit.DB Namespace